import { PricingPlansType } from '../types'

export const PRICING_PLANS_DATA: PricingPlansType[] = [
	{
		title: 'Базовый',
		description:
			'Стартовый уровень для самостоятельного, но осознанного изучения.',
		includedItems: [
			{
				label: 'Короткие видео-уроки (15–30 минут) с чёткими объяснениями',
			},
			{
				label: 'Домашние задания с проверкой',
			},
			{
				label: 'Поддержку преподавателя в учебном чате',
			},
			{
				label: 'Практические вебинары',
			},
			{
				label: 'Гайды и примеры для закрепления материала',
			},
		],
		additionalItems: [
			{
				label: 'заложить фундамент,',
			},
			{
				label: 'понять базовые темы,',
			},
			{
				label: 'привыкнуть к регулярности обучения.',
			},
		],
		additionalDescription:
			'Подходит тем, кто делает первые шаги в изучении и хочет укреплять знания постепенно.',
		price: '8000 сом',
		popular: false,
	},
	{
		title: 'Оптимальный',
		description:
			'Баланс самостоятельности и сопровождения, основанный на принципе «талим ва тарбия» — обучение + воспитание.',
		includedItems: [
			{
				label: 'Короткие видео-уроки (15–30 минут) с чёткими объяснениями',
			},
			{
				label: 'Домашние задания с проверкой',
			},
			{
				label: 'Поддержку преподавателя в учебном чате',
			},
			{
				label: 'Практические вебинары',
			},
			{
				label: 'Гайды и примеры для закрепления материала',
			},
		],
		additionalItems: [
			{
				label: 'заложить фундамент,',
			},
			{
				label: 'понять базовые темы,',
			},
			{
				label: 'привыкнуть к регулярности обучения.',
			},
		],
		additionalDescription:
			'Подходит тем, кто делает первые шаги в изучении и хочет укреплять знания постепенно.',
		price: '15 000 сом',
		popular: true,
	},
	{
		title: 'Индивидуальный',
		description:
			'Персональное наставничество. Основан на классическом принципе «талаккы» — передача знаний из рук учителя к ученику.',
		includedItems: [
			{
				label: 'Короткие видео-уроки (15–30 минут) с чёткими объяснениями',
			},
			{
				label: 'Домашние задания с проверкой',
			},
			{
				label: 'Поддержку преподавателя в учебном чате',
			},
			{
				label: 'Практические вебинары',
			},
			{
				label: 'Гайды и примеры для закрепления материала',
			},
		],
		additionalItems: [
			{
				label: 'заложить фундамент,',
			},
			{
				label: 'понять базовые темы,',
			},
			{
				label: 'привыкнуть к регулярности обучения.',
			},
		],
		additionalDescription:
			'Подходит тем, кто делает первые шаги в изучении и хочет укреплять знания постепенно.',
		price: '25 000 сом',
		popular: false,
	},
] as const
